Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository_collaborator.this["docs:jennijuju"] will be destroyed
  # (because key ["docs:jennijuju"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "docs:jennijuju" -> null
      - permission = "maintain" -> null
      - repository = "docs" -> null
      - username   = "jennijuju" -> null
    }

  # github_repository_collaborator.this["docs:johndmulhausen"] will be destroyed
  # (because key ["docs:johndmulhausen"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "docs:johndmulhausen" -> null
      - permission = "push" -> null
      - repository = "docs" -> null
      - username   = "johndmulhausen" -> null
    }

  # github_repository_collaborator.this["docs:walkerlj0"] must be replaced
-/+ resource "github_repository_collaborator" "this" {
      ~ id                          = "docs:walkerlj0" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ permission                  = "maintain" -> "triage" # forces replacement
      + permission_diff_suppression = false
        # (2 unchanged attributes hidden)
    }

  # github_repository_collaborator.this["go-libp2p-noise:yusefnapora"] will be destroyed
  # (because key ["go-libp2p-noise:yusefnapora"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "go-libp2p-noise:yusefnapora" -> null
      - permission = "admin" -> null
      - repository = "go-libp2p-noise" -> null
      - username   = "yusefnapora" -> null
    }

  # github_repository_collaborator.this["website-1:dannys03"] must be replaced
-/+ resource "github_repository_collaborator" "this" {
      ~ id                          = "website-1:DannyS03" -> (known after apply)
      + invitation_id               = (known after apply)
      ~ permission                  = "admin" -> "push" # forces replacement
      + permission_diff_suppression = false
        # (2 unchanged attributes hidden)
    }

  # github_repository_collaborator.this["website:dannys03"] will be destroyed
  # (because key ["website:dannys03"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "website:DannyS03" -> null
      - permission = "maintain" -> null
      - repository = "website" -> null
      - username   = "DannyS03" -> null
    }

  # github_team_membership.this["admin:yusefnapora"] will be destroyed
  # (because key ["admin:yusefnapora"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"29e66c951496f2617a9e416d96c64ba717cdf026e5e6b69518574eb7473d856b\"" -> null
      - id       = "2077192:yusefnapora" -> null
      - role     = "member" -> null
      - team_id  = "2077192" -> null
      - username = "yusefnapora" -> null
    }

  # github_team_membership.this["bifrost:dharmapunk82"] will be destroyed
  # (because key ["bifrost:dharmapunk82"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"0f6c4cc8855257ca45782f0e6247528048aad79a415cb24a28147812d8e2472f\"" -> null
      - id       = "6201425:dharmapunk82" -> null
      - role     = "member" -> null
      - team_id  = "6201425" -> null
      - username = "dharmapunk82" -> null
    }

  # github_team_membership.this["bifrost:karolkozlowski"] will be destroyed
  # (because key ["bifrost:karolkozlowski"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"dc2c51417e75b4e2a9cc5a08a7308cdbacb17e184d261cea648490324ec7e250\"" -> null
      - id       = "6201425:KarolKozlowski" -> null
      - role     = "member" -> null
      - team_id  = "6201425" -> null
      - username = "KarolKozlowski" -> null
    }

  # github_team_membership.this["docs:dannys03"] will be updated in-place
  ~ resource "github_team_membership" "this" {
        id       = "5688138:DannyS03"
      ~ role     = "maintainer" -> "member"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.this["docs:jchris"] will be destroyed
  # (because key ["docs:jchris"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"d0a72943c40def8673a3b8a8800d6806870378643d5fae9656468766fde63a0a\"" -> null
      - id       = "5688138:jchris" -> null
      - role     = "member" -> null
      - team_id  = "5688138" -> null
      - username = "jchris" -> null
    }

  # github_team_membership.this["docs:momack2"] will be destroyed
  # (because key ["docs:momack2"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"a87ca2d717f6df9cecd2db41e86b6bf5878f927c70bf552f4f82818990b65428\"" -> null
      - id       = "5688138:momack2" -> null
      - role     = "maintainer" -> null
      - team_id  = "5688138" -> null
      - username = "momack2" -> null
    }

  # github_team_membership.this["docs:p-shahi"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "5688138"
      + username = "p-shahi"
    }

  # github_team_membership.this["docs:walkerlj0"] will be destroyed
  # (because key ["docs:walkerlj0"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"122afe12427c60424aead22a80c7936a8a3a44b0c7566c934f649caf54dc67dc\"" -> null
      - id       = "5688138:walkerlj0" -> null
      - role     = "member" -> null
      - team_id  = "5688138" -> null
      - username = "walkerlj0" -> null
    }

  # github_team_membership.this["docs:yusefnapora"] will be destroyed
  # (because key ["docs:yusefnapora"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"c5cb85fbe1394660674f3df79a2340d3569cacf771d93cae40850db75eee1730\"" -> null
      - id       = "5688138:yusefnapora" -> null
      - role     = "member" -> null
      - team_id  = "5688138" -> null
      - username = "yusefnapora" -> null
    }

  # github_team_membership.this["repos - javascript:hugomrdias"] will be destroyed
  # (because key ["repos - javascript:hugomrdias"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"4e07e93eadbb4b139f2e3b4df3e49cdb4f8c3fa9c026d91b345875ed4d8fed38\"" -> null
      - id       = "2120753:hugomrdias" -> null
      - role     = "member" -> null
      - team_id  = "2120753" -> null
      - username = "hugomrdias" -> null
    }

  # github_team_membership.this["repos - javascript:yusefnapora"] will be destroyed
  # (because key ["repos - javascript:yusefnapora"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"fa48eaa9b5c1a56a4b7ca0d979751cdb528eee0dd1ac040f3e438a5d710cb2e5\"" -> null
      - id       = "2120753:yusefnapora" -> null
      - role     = "member" -> null
      - team_id  = "2120753" -> null
      - username = "yusefnapora" -> null
    }

  # github_team_membership.this["w3dt-stewards:ajnavarro"] will be destroyed
  # (because key ["w3dt-stewards:ajnavarro"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"d1fc7394f667fac0b3c9d8f9ee4683ad69cf0119adc5efcd73301273dcbfaa55\"" -> null
      - id       = "4657013:ajnavarro" -> null
      - role     = "member" -> null
      - team_id  = "4657013" -> null
      - username = "ajnavarro" -> null
    }

  # github_team_membership.this["w3dt-stewards:arajasek"] will be destroyed
  # (because key ["w3dt-stewards:arajasek"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"53915f7e4f5570c2d6c0215b65dfd15998b02b439beb6d63b182997ea21b899e\"" -> null
      - id       = "4657013:arajasek" -> null
      - role     = "member" -> null
      - team_id  = "4657013" -> null
      - username = "arajasek" -> null
    }

  # github_team_membership.this["w3dt-stewards:tinytb"] will be destroyed
  # (because key ["w3dt-stewards:tinytb"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"dd19367e8183e2714883d4a3938e9fcd7e73758761693583557db3a1766ac56f\"" -> null
      - id       = "4657013:tinytb" -> null
      - role     = "member" -> null
      - team_id  = "4657013" -> null
      - username = "tinytb" -> null
    }

  # github_team_repository.this["admin:website-1"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "website-1"
      + team_id    = "2077192"
    }

  # github_team_repository.this["w3dt-stewards:website-1"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "website-1"
      + team_id    = "4657013"
    }

Plan: 5 to add, 1 to change, 18 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->